Public Attributes | List of all members
API_CameraType Struct Reference
Element Manager API
Represents a single camera. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | camSetGuid
This camera belongs to this camera set.
API_PerspCamPars  | perspCam
Perspective camera parameters.
Detailed Description
Represents a single camera.
Member Data Documentation
◆ camSetGuid
 API_CameraType::camSetGuid
This camera belongs to this camera set.
◆ head
 API_CameraType::head
General element header.
◆ perspCam
 API_CameraType::perspCam
Perspective camera parameters.